app/views/devise/registrations/new.html.erb

SELECT  "roles".* FROM "roles"  ORDER BY "roles"."id" ASC LIMIT 1
---
              <!-- Default Role id -->
              <%= f.hidden_field :role_id, value: Role.first.id %>