app/views/prophent_messages/show.html.erb

            </div>
            <% if user_signed_in? && current_user.role.name.include?('Student') && @pro_message.user_feedback.nil? %>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "user_feedbacks".* FROM "user_feedbacks" WHERE "user_feedbacks"."prophent_message_id" = ? LIMIT 1  [["prophent_message_id", 1]]