app/views/users/prophet_new.html.erb

          <!-- Default Role id -->
          <%= f.hidden_field :role_id, value: Role.find(2).id %>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 2]]