app/controllers/api/v1/users/registrations_controller.rb

        def create
          email = params[:user][:email]
          check_user = User.find_by(email: email)
          if check_user
            p 'Email A----------------'
            render_failed({ success: false, msg: "Email Already taken" })
          else
            @user = User.new(user_params)
            p '---------------------------------------------'
            p @user.errors.full_messages
            begin
              if params[:image].present? and params[:image] != "data:image/jpeg;base64,null"
                data = params[:image].gsub(" ", "+")
                data_uri = data.split(",")[1]
                extention = "png"
                encoded_image = data_uri
                decoded_image = Base64.decode64(encoded_image)
                img_name = "tmp/img_#{Time.now.to_i}.#{extention}"
                File.open(img_name, "wb") { |f| f.write(decoded_image) }
                @user.image = File.open(img_name)
              end
            rescue Exception => e
              p "something went wrong"
              p e
            end
            @user.role_id = Role.find_by(name: "Student").id
            if @user.save
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT 1  [["name", "Student"]]
INSERT INTO "users" ("email", "encrypted_password", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)