app/controllers/api/v1/admins_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT 1  [["name", "Prophent"]]
INSERT INTO "users" ("name", "age", "gender", "email", "encrypted_password", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
        def prophent_create
        	if @user.admin?
	        	@prophent = User.new(user_params)
	        	@prophent.role_id = Role.find_by(name: "Prophent").id
	        	if @prophent.save

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT 1  [["name", "Prophent"]]
SELECT "users".* FROM "users" WHERE "users"."role_id" = ?  [["role_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
SELECT COUNT(*) FROM "users" WHERE "users"."role_id" = ?  [["role_id", 2]]
---
        def index
        	if @user.admin?
	        	role_id = Role.find_by(name: "Prophent").id
	        	@prophet_list = User.where(role_id: role_id)
	        	if @prophet_list.count > 0

SELECT "prophent_messages".* FROM "prophent_messages"
---
        def all_prophent_messages
        	if @user.admin?
        		@prophent_messages = ProphentMessage.all

INSERT INTO "admin_posts" ("url", "title", "message", "is_active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
        def admin_posts_create
        	@admin_post = @user.admin_posts.new(admin_post_params)
        	if @admin_post.save

SELECT "admin_posts".* FROM "admin_posts"
SELECT COUNT(*) FROM "admin_posts"
---
        def admin_posts
        	if @user.admin?
        		@admin_posts = AdminPost.all
        		if @admin_posts.count > 0

SELECT  "admin_posts".* FROM "admin_posts" WHERE "admin_posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "admin_posts" SET "url" = ?, "updated_at" = ? WHERE "admin_posts"."id" = ?  [["url", "http://gmail.com"], ["updated_at", "2016-12-29 12:55:34.417323"], ["id", 3]]
---
        def admin_posts_update
        	@admin_post = AdminPost.find_by(id: params[:admin_post_id])
        	if @admin_post.present?
        		if @admin_post.update(admin_post_params)

SELECT  "admin_posts".* FROM "admin_posts" WHERE "admin_posts"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "admin_posts" WHERE "admin_posts"."id" = ?  [["id", 3]]
---
        def admin_posts_delete
        	@admin_post = AdminPost.find_by(id: params[:admin_post_id])
        	if @admin_post.present?
        		if @admin_post.destroy