app/controllers/api/v1/prophents_controller.rb

SELECT "user_requests".* FROM "user_requests" WHERE "user_requests"."status" = ?  [["status", "pending"]]
SELECT COUNT(*) FROM "user_requests" WHERE "user_requests"."status" = ?  [["status", "pending"]]
---
        def prophents
        	if @user.present?
        		@user_requests = UserRequest.where(status: "pending")
        		if @user_requests.count > 0

INSERT INTO "prophent_messages" ("title", "message", "user_request_id", "prophent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Test Title"], ["message", "Test Message"], ["user_request_id", 4], ["prophent_id", 5], ["created_at", "2016-12-29 11:01:19.579318"], ["updated_at", "2016-12-29 11:01:19.579318"]]
---
        def prophent_message_create
        	@prophent_message = @user.prophent_messages.new(prophent_message_params)
			    if @prophent_message.save

SELECT  "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
        def prophent_message_show
        	@pro_message = ProphentMessage.find_by(id: params[:id])
          @student = UserRequest.find_by(id: @pro_message.user_request_id).user