app/controllers/api/v1/requests_controller.rb

        def create_request
        	UserRequest.create(status: "pending", student_id: @user.id)
---
INSERT INTO "user_requests" ("status", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["status", "pending"], ["student_id", 2], ["created_at", "2016-12-29 08:43:04.351107"], ["updated_at", "2016-12-29 08:43:04.351107"]]

        def accept_request
          @request = UserRequest.find_by(id: params[:id])
          if @request.present?
            @request.update_attributes(status: "Accepted", prophent_id: @user.id, accepted_at: Time.now)
---
SELECT  "user_requests".* FROM "user_requests" WHERE "user_requests"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "user_requests" SET "prophent_id" = ?, "accepted_at" = ?, "updated_at" = ? WHERE "user_requests"."id" = ?  [["prophent_id", 10], ["accepted_at", "2016-12-30"], ["updated_at", "2016-12-30 06:04:59.307790"], ["id", 2]]