app/controllers/api/v1/users_controller.rb

        def prophent_history
          if @user.present?
            @histroy = @user.prophent_messages
            if @histroy.count > 0
---
SELECT "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."prophent_id" = ?  [["prophent_id", 5]]
SELECT COUNT(*) FROM "prophent_messages" WHERE "prophent_messages"."prophent_id" = ?  [["prophent_id", 2]]

        def user_feedback
          @prophent_message = ProphentMessage.find_by(id: params[:prophent_message_id])
          if @prophent_message.present?
            @feedback = @prophent_message.build_user_feedback(user_feedback_params)
            if @feedback.save
---
SELECT  "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "prophent_messages".* FROM "prophent_messages" WHERE (4) LIMIT 1
INSERT INTO "user_feedbacks" ("message", "prophent_message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Test Feedback"], ["prophent_message_id", 1], ["created_at", "2016-12-29 11:45:31.579704"], ["updated_at", "2016-12-29 11:45:31.579704"]]
UPDATE "user_feedbacks" SET "prophent_message_id" = ?, "updated_at" = ? WHERE "user_feedbacks"."id" = ?  [["prophent_message_id", nil], ["updated_at", "2016-12-29 11:47:27.509153"], ["id", 3]]

        def profile_edit
          if @user.present?
            begin
              if params[:image].present?
                data = params[:image].gsub(" ", "+")
                data_uri = data.split(",")[1]
                extention = "png"
                encoded_image = data_uri
                decoded_image = Base64.decode64(encoded_image)
                img_name = "tmp/img_#{Time.now.to_i}.#{extention}"
                File.open(img_name, "wb") { |f| f.write(decoded_image) }
                @user.image = File.open(img_name)
                @user.save
---
UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 45], ["updated_at", "2016-12-29 14:17:04.900577"], ["id", 1]]