app/controllers/admin_posts_controller.rb

  def index
    @admin_posts = AdminPost.all.order('created_at DESC').paginate(page: params[:page], per_page: 10)
---
SELECT  "admin_posts".* FROM "admin_posts"  ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def create
    @admin_post = current_user.admin_posts.new(admin_post_params)

    respond_to do |format|
      if @admin_post.save
---
INSERT INTO "admin_posts" ("url", "title", "message", "is_active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_admin_post
      @admin_post = AdminPost.find(params[:id])
---
SELECT  "admin_posts".* FROM "admin_posts" WHERE "admin_posts"."id" = ? LIMIT 1  [["id", 2]]

    def set_false_info
      @info = AdminPost.where(is_active: true).first
---
SELECT  "admin_posts".* FROM "admin_posts" WHERE "admin_posts"."is_active" = ?  ORDER BY "admin_posts"."id" ASC LIMIT 1  [["is_active", "t"]]