app/controllers/homes_controller.rb

  def admin
    @prophet_list = User.where(role_id: 2).order('created_at DESC').paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."role_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["role_id", 2]]

  def index
    @admin_info = AdminPost.where(is_active: true).first
---
SELECT  "admin_posts".* FROM "admin_posts" WHERE "admin_posts"."is_active" = ?  ORDER BY "admin_posts"."id" ASC LIMIT 1  [["is_active", "t"]]