app/controllers/prophent_messages_controller.rb

  def index
    if current_user.admin?
      @histories = ProphentMessage.all.paginate(page: params[:page], per_page: 10)
---
SELECT  "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."prophent_id" = ? LIMIT 10 OFFSET 0  [["prophent_id", 5]]
SELECT COUNT(*) FROM "prophent_messages"

  def create
    @prophent_message = current_user.prophent_messages.new(prophent_message_params)
    if @prophent_message.save
---
INSERT INTO "prophent_messages" ("title", "message", "user_request_id", "prophent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Subject "], ["message", "test"], ["user_request_id", 1], ["prophent_id", 5], ["created_at", "2016-12-29 07:24:10.747458"], ["updated_at", "2016-12-29 07:24:10.747458"]]

  def show
    @pro_message = ProphentMessage.find(params[:id])
---
SELECT  "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."id" = ? LIMIT 1  [["id", 1]]