app/controllers/prophents_controller.rb

  def index
    @requests = UserRequest.where(status: "pending").paginate(page: params[:page], per_page: 10)
---
SELECT  "user_requests".* FROM "user_requests" WHERE "user_requests"."status" = ? LIMIT 10 OFFSET 0  [["status", "pending"]]