app/controllers/requests_controller.rb

  def create_request
    UserRequest.create(status: "pending", student_id: current_user.id)
---
INSERT INTO "user_requests" ("status", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["status", "pending"], ["student_id", 3], ["created_at", "2016-12-29 06:59:03.819518"], ["updated_at", "2016-12-29 06:59:03.819518"]]

  def accept_request
    @request = UserRequest.find(params[:id])
    @request.update_attributes(status: "Accepted", prophent_id: current_user.id, accepted_at: Time.now)
---
SELECT  "user_requests".* FROM "user_requests" WHERE "user_requests"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "user_requests" SET "status" = ?, "prophent_id" = ?, "accepted_at" = ?, "updated_at" = ? WHERE "user_requests"."id" = ?  [["status", "Accepted"], ["prophent_id", 5], ["accepted_at", "2016-12-29"], ["updated_at", "2016-12-29 07:23:32.582728"], ["id", 1]]