app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "gender", "email", "encrypted_password", "image", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def prophet_create
  	@user = User.new(user_params)
  	if @user.save