app/controllers/user_feedbacks_controller.rb

INSERT INTO "user_feedbacks" ("message", "prophent_message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "hdfhgv"], ["prophent_message_id", 2], ["created_at", "2016-12-29 07:48:48.469836"], ["updated_at", "2016-12-29 07:48:48.469836"]]
---
  def create
    @feedback = @message.build_user_feedback(user_feedback_params)
    if @feedback.save

SELECT  "prophent_messages".* FROM "prophent_messages" WHERE "prophent_messages"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_user_feedback
    @message = ProphentMessage.find(params[:prophent_message_id])